from typing import TypedDict

from langgraph.graph import StateGraph, START, END


# ============================================================
# 1. 定义 State
# ============================================================

class State(TypedDict):                                                                                                           
    message: str


# ============================================================
# 2. 定义普通节点
# ============================================================

def check_node(state: State):
    print("执行 Check Node")

    return state


def node_a(state: State):
    print("执行 Node A")

    return {
        "message": state["message"] + " → A"
    }


def node_b(state: State):
    print("执行 Node B")

    return {
        "message": state["message"] + " → B"
    }


# ============================================================
# 3. 定义条件路由函数
# ============================================================

def route(state: State):
    if state["message"] == "A":
        return "go_a"

    return "go_b"


# ============================================================
# 4. 创建 Graph
# ============================================================

graph_builder = StateGraph(State)


# ============================================================
# 5. 添加节点
# ============================================================

graph_builder.add_node("check", check_node)
graph_builder.add_node("node_a", node_a)
graph_builder.add_node("node_b", node_b)


# ============================================================
# 6. START → check
# ============================================================

graph_builder.add_edge(START, "check")


# ============================================================
# 7. 添加条件边
# ============================================================

graph_builder.add_conditional_edges(   #三个参数1逻辑执行起始节点  2路由函数，处理1返回的值   3映射表2返回的值是映射表的KEY
    "check",
    route,
    {
        "go_a": "node_a",
        "go_b": "node_b"
    }
)


# ============================================================
# 8. 两条路径最终都结束
# ============================================================

graph_builder.add_edge("node_a", END)
graph_builder.add_edge("node_b", END)


# ============================================================
# 9. 编译
# ============================================================

graph = graph_builder.compile()


# ============================================================
# 10. 测试 A 路径
# ============================================================

print("========== 测试 A ==========")

result = graph.invoke({
    "message": "A"
})

print("最终 State：")
print(result)


# ============================================================
# 11. 测试 B 路径
# ============================================================

print("\n========== 测试 B ==========")

result = graph.invoke({
    "message": "B"
})

print("最终 State：")
print(result)